Repository: Dabolus/portfolio
Catalog: pwa/src/locales/*.po
Languages: it

# formalDescription
source: Giorgio Garasto—also known as Dabolus—is an italian Software Engineer and Graphic Designer specialized in web development. He is mainly known for his very first published project, the Clash Royale Card Maker.
it: Giorgio Garasto — in arte Dabolus — è uno Sviluppatore Software e Grafico proveniente dall'Italia specializzato nello sviluppo web. È conosciuto principalmente per il suo primo progetto pubblicato, il Clash Royale Card Maker.

# companyAddress
source: Via Stendhal, 36, 20144 Milano MI, Italy
it: Via Stendhal, 36, 20144 Milano MI, Italia

# updateAvailable
source: A new version of the web app is available!
it: Una nuova versione della web app è disponibile!

source: Cancel
it: Annulla

source: Update now
it: Aggiorna ora

# error
source: There was an error, please try again later
it: C'è stato un errore, riprova più tardi

# homeDescription
source: Hi! I'm Giorgio, a Software Engineer trying to make the web a better place since 2004.
it: Ciao! Sono Giorgio, uno Sviluppatore Software che cerca di rendere il web un posto migliore dal 2004.

# greeting
source: Hi! I'm Giorgio.
it: Ciao! Sono Giorgio.

source: A
it: Un

source: Software Engineer
it: Programmatore

# mobileWebSpecialist
source: <img src="../images/google-g.svg" id="google-g" alt="Google" title="Google" width="21" height="21"><span>&nbsp;Certified Mobile Web Specialist</span>
it: <span>Mobile Web Specialist certificato&nbsp;</span><img src="../images/google-g.svg" id="google-g" alt="Google" title="Google" width="21" height="21">

source: Cloud Technician
it: Tecnico Cloud

# graphicDesigner
source: Graphic Designer (sort of)
it: Grafico (più o meno)

# musician
source: Musician in free time
it: Musicista nel tempo libero

# aim
source: trying to make the web a better place&nbsp;<a id="since-2004-link" rel="external" href="https://translate.google.com/translate?js=n&sl=it&tl=en&u=https://web.archive.org/web/20101103024916/http://www.w3schools.it:80/" target="since-2004" rel="noopener">since&nbsp;2004</a>.
it: che cerca di rendere il web un posto migliore&nbsp;<a id="since-2004-link" rel="external" href="https://web.archive.org/web/20101103024916/http://www.w3schools.it:80/" target="since-2004" rel="noopener">dal&nbsp;2004</a>.

# aboutDescription
source: Curious about who I am? Get to know me and what I do.
it: Vuoi sapere chi sono? Vieni a conoscere me e ciò che faccio.

# bio
source: My name is Giorgio Garasto and I'm %age% years old. I put my hands on HTML for the first time when I was seven years old to help my father, and I've never stopped playing with it since then. The passion for web development influenced both my work and study choices and brought me to gain a <a href="https://www.udacity.com/grow-with-google" rel="external" target="scholarship">scholarship</a> from Google and Udacity that gave me the chance to obtain the <a href="https://developers.google.com/training/certification/mobile-web-specialist" rel="external" target="mws">Mobile Web Specialist</a> certification. At work, I gained a vast experience in front end development by means of libraries and frameworks such as <a href="https://reactjs.org" rel="external" target="react">React</a> and <a href="https://angular.io" rel="external" target="angular">Angular</a>, as well as using native technologies, like Web Components and Service Workers. On the back end side, I mainly use <a href="https://nodejs.org" rel="external" target="nodejs">Node.js</a> and <a href="https://golang.org" rel="external" target="golang" aria-label="Go">Go</a>. Outside the working world, I like devoting myself to music. I love playing guitar and singing, but I do dabble also with piano and drums. Right now, I'm working as a Frontend Engineer at <a href="https://www.empatica.com" rel="noopener" target="empatica">Empatica</a>, an MIT spin-off company based in Boston and Milan with more than 70 employees, whose goal is to design and develop AI systems to monitor human health through wearable sensors. I also have a bunch of open source projects, which you can check out <a href="/en/projects">in the projects section</a>.
it: Mi chiamo Giorgio Garasto e ho %age% anni. Ho messo mano all'HTML per la prima volta quando avevo sette anni per dare una mano a mio padre, e da quel giorno non ho mai smesso di giocarci. La passione per lo sviluppo web ha influenzato tutte le mie scelte, lavorative e di studio, e mi ha portato ad ottenere una <a href="https://www.udacity.com/grow-with-google" rel="external" target="scholarship">borsa di studio</a> da parte di Google e Udacity che mi ha dato la possibilità di ottenere la certificazione di <a href="https://developers.google.com/training/certification/mobile-web-specialist" rel="external" target="mws">Mobile Web Specialist</a>. Sul lavoro, ho acquisito una vasta esperienza nello sviluppo front end per mezzo di librerie e framework quali <a href="https://reactjs.org" rel="external" target="react">React</a> e <a href="https://angular.io" rel="external" target="angular">Angular</a>, oltre che per mezzo di tecnologie native, come ad esempio i Web Component e i Service Worker. Lato back end, utilizzo prevalentemente <a href="https://nodejs.org" rel="external" target="nodejs">Node.js</a> e <a href="https://golang.org" rel="external" target="golang" aria-label="Golang">Go</a>. Al di fuori del mondo lavorativo, mi piace dedicarmi alla musica. Amo suonare la chitarra e cantare, ma mi diletto anche con il pianoforte e con le percussioni. In questo momento, sto lavorando come Sviluppatore Frontend presso <a href="https://www.empatica.com" rel="noopener" target="empatica">Empatica</a>, un'azienda spin-off del MIT con sede a Boston e a Milano, il cui obiettivo è quello di progettare e sviluppare sistemi di IA per monitorare la salute umana attraverso sensori indossabili. Ho anche svariati progetti open source, che puoi trovare <a href="/it/projects">nella sezione progetti</a>.

source: My story
it: La mia storia

# certificationsDescription
source: Check out my certifications and awards.
it: Scopri le mie certificazioni e i miei premi.

# contactsDescription
source: Interested in what I do and/or have some questions? Contact me!
it: Ti interessa ciò che faccio e/o hai qualche domanda? Contattami!

# hi
source: Hi Giorgio
it: Ciao Giorgio

# reason
source: I'm writing to you to talk about
it: Ti scrivo per parlare di

source: Subject
it: Oggetto

source: Message
it: Messaggio

# contactMeBack
source: You can contact me back at
it: Puoi contattarmi all'indirizzo

source: Sincerely
it: Cordiali saluti

source: Name
it: Nome

source: Submit
it: Invia

# alsoFindMe
source: P.S. you can also find me on
it: P.S. puoi anche trovarmi su

# projectsDescription
source: Check out the list of the projects I built and maintain.
it: Dai un'occhiata alla lista dei progetti che ho sviluppato e che mantengo.

# skillsDescription
source: Want to know what I am good at? Check it out here.
it: Vuoi sapere in cosa sono bravo? Puoi scoprirlo qui.

source: Coding
it: Programmazione

# mostConfidentLangs
source: Languages I feel most confident with
it: Linguaggi con cui mi sento più a mio agio

# mostUsedLangs
source: Languages I use the most
it: Linguaggi che uso di più

source: Music
it: Musica

source: Soft skills
it: Soft skill

source: Back
it: Indietro

source: Me
it: Io

# veryInterested
source: You seem very interested in my story.
it: Sembra ti interessi molto la mia storia.

# getResume
source: Get my resume
it: Scarica il mio resume

# resumeError
source: There was an error getting the resume, please try again.
it: C'è stato un errore scaricando il resume, riprova.

# helloWorldDescription
source: It was 23:20 when my first commit was pushed to the <code>world</code> repo, on the <code>italy</code> branch.
it: Erano le 23:20 quando il mio primo commit è stato pushato sulla repo <code>mondo</code>, nel branch <code>italia</code>.

# firstStepsTitle
source: First steps
it: Primi passi

# firstStepsDescription
source: My father asked me to help him with his work, and that's when I discovered HTML.
it: Mio padre mi ha chiesto di aiutarlo col suo lavoro, ed è allora che ho scoperto l'HTML.

# lavoriInCorsoTitle
source: The first work experience ever…
it: La prima esperienza lavorativa…

# lavoriInCorsoDescription
source: During the school summer break, I applied to be part of a group of students who had the chance to work for our province as handymen.
it: Durante le vacanze estive, ho fatto domanda per far parte di un gruppo di studenti che ha avuto la possibilità di lavorare per la nostra provincia come tuttofare.

# milani6InternshipTitle
source: …and the first one in the IT world
it: …e la prima nel mondo IT

# milani6InternshipDescription
source: While working for the province of Pordenone, I also started an internship at a furniture shop called <a href="https://milani6.com" target="milani6" rel="noopener">Milani6</a>, where a school<wbr>mate and I built a simple e-commerce in AngularJS 1 and PHP.
it: Mentre lavoravo per la provincia di Pordenone, ho iniziato uno stage ad un negozio di mobili chiamato <a href="https://milani6.com" target="milani6" rel="noopener">Milani6</a>, dove un compagno di classe e io abbiamo sviluppato un semplice e-commerce in AngularJS 1 e PHP.

# lionbridgeTitle
source: Working smartly
it: Lo smart working

# lionbridgeDescription
source: Through <a href="https://www.lionbridge.com" target="lionbridge" rel="noopener">Lionbridge</a>, I applied to become a Google Ads Quality Evaluator. That job taught me what smart working is, thanks to being a remote work without a fixed schedule. It also taught me to think like end users and to understand their intent.
it: Tramite <a href="https://www.lionbridge.com" target="lionbridge" rel="noopener">Lionbridge</a>, ho fatto domanda per diventare un Google Ads Quality Evaluator. Quel lavoro mi ha insegnato cos'è lo smart working, grazie al fatto di essere un lavoro da remoto e senza orari fissi. Mi ha anche insegnato a pensare come un utente finale e a capire il suo intento.

# realCommInternshipDescription
source: During my first year at the ITS Kennedy Foundation, I did a two-month internship at <a href="https://www.realcomm.it" target="realcomm" rel="noopener">Real Comm</a>, where I built ASP.NET MVC web applications using C#.
it: Durante il primo anno alla Fondazione ITS Kennedy, ho fatto due mesi di stage alla <a href="https://www.realcomm.it" target="realcomm" rel="noopener">Real Comm</a>, dove ho sviluppato applicazioni web MVC con ASP.NET, utilizzando C#.

# googleScholarshipDescription
source: Google partnered with Udacity to offer scholarships to selected students. After a few months of selection, I was chosen to be one of the 5,000 recipients out of the more than 200,000 candidates that applied.
it: Google ha collaborato con Udacity per offrire borse di studio a degli studenti selezionati. Dopo qualche mese di selezione, sono stato scelto per essere uno dei 5.000 destinatari tra gli oltre 200.000 candidati che hanno fatto domanda.

# molo17InternshipTitle
source: MOLO17 // Internship…
it: MOLO17 // Stage…

# molo17InternshipDescription
source: Another ITS Kennedy Foundation year, another internship! This time it was a three-month intership at <a href="https://molo17.com" target="molo17" rel="noopener">MOLO17</a>, where I was able to work with cutting edge technologies that I love.
it: Un altro anno alla Fondazione ITS Kennedy, un altro stage! Questa volta ho fatto tre mesi di stage alla <a href="https://molo17.com" target="molo17" rel="noopener">MOLO17</a>, dove ho potuto lavorare con le tecnologie all'avanguardia che amo.

# molo17ContractTitle
source: …and first full-time contract
it: …e primo contratto a tempo pieno

# molo17ContractDescription
source: At the end of the internship, I've been asked to work for <a href="https://molo17.com"target="molo17" rel="noopener">MOLO17</a> after finishing my studies. I really liked the technologies we used and the development team, so I was happy to accept.
it: Alla fine dello stage, mi è stato chiesto di iniziare a lavorare per <a href="https://molo17.com"target="molo17" rel="noopener">MOLO17</a> dopo la fine degli studi. Mi piacevano molto le tecnologie utilizzate e il team di sviluppo, quindi sono stato felice di accettare.

# mobileWebSpecialistDescription
source: After completing the Google Developer Scholarship, I was finally ready to obtain the Google <a href="https://web.archive.org/web/20190516134811/https://developers.google.com/training/certification/mobile-web-specialist" rel="external" target="mws">Mobile Web Specialist</a> certification.
it: Dopo aver completato la Google Developer Scholarship, ero finalmente pronto per ottenere la certificazione di <a href="https://web.archive.org/web/20190516134811/https://developers.google.com/training/certification/mobile-web-specialist" rel="external" target="mws">Mobile Web Specialist</a> da parte di Google.

# facebookScholarshipDescription
source: When I came to know of the Facebook PyTorch Scholarship challenge, I was incredibly excited thinking about the great products I could have built combining my web skills with machine learning. However, I only knew Python a little and I had no idea of how machine learning works at the time, so I had some difficulties following the course.
it: Quando ho saputo della Facebook PyTorch Scholarship challenge, ero incredibilmente elettrizzato pensando ai grandi progetti che avrei potuto sviluppare combinando le mie abilità nello sviluppo web col machine learning. Tuttavia, conoscevo poco il Python e non avevo idea di come funzionasse il machine learning all'epoca, quindi ho avuto delle difficoltà nel seguire il corso.

# bertelsmannScholarshipDescription
source: I wasn't happy with how the Facebook PyTorch Scholarship went, so I wanted to give AI another chance. That's why—among the available tracks of the Bertelsmann Technology Scholarship—I chose the AI track. However, due to the huge amount of work I had at the time, I wasn't able to follow it properly, ending up with the same result as my first AI scholarship.
it: Non ero felice di com'era andata la Facebook PyTorch Scholarship, quindi ho voluto dare un'altra occasione all'IA. Per questo motivo — tra i percorsi offerti dalla Bertelsmann Technology Scholarship — ho scelto il percorso IA. Tuttavia, a causa della quantità di lavoro che avevo all'epoca, non sono riuscito a seguirla come avrei voluto, finendo per avere lo stesso risultato avuto con la mia prima borsa di studio sull'IA.

# intelScholarshipDescription
source: I thought the third time would be the good one, but apparently working with OpenVINO™ is not my thing. What I learned from these three AI scholarships is that I like what AIs do, but I don't really like building them. Better late than ever, right?
it: Pensavo che la terza volta sarebbe potuta essere quella buona, ma a quanto pare lavorare con OpenVINO™ non è cosa per me. Ciò che ho imparato da queste tre borse di studio sull'IA è che mi piace ciò che le IA fanno, ma non mi piace molto svilupparle. Meglio tardi che mai, giusto?

# blockchainNanodegreeDescription
source: I've been interested in and have been experimenting with the Ethereum blockchain since 2017, so—during the new crypto boom—I finally decided to take the leap by taking the Udacity <a href="https://www.udacity.com/course/blockchain-developer-nanodegree--nd1309" target="blockchain-nanodegree" rel="noopener">Blockchain Developer Nanodegree</a>.
it: Sono stato interessato e ho sperimentato con la blockchain Ethereum dal 2017, quindi — durante il nuovo boom delle criptovalute — ho finalmente deciso di fare il salto partecipando al <a href="https://www.udacity.com/course/blockchain-developer-nanodegree--nd1309" target="blockchain-nanodegree" rel="noopener">Blockchain Developer Nanodegree</a> di Udacity.

# empaticaContractTitle
source: Starting a new adventure
it: Iniziando una nuova avventura

# empaticaContractDescription
source: I've always been eager to help people. That's why—when I came to know of <a href="https://www.empatica.com" target="empatica" rel="noopener">Empatica</a>—applying was quite a natural choice.
it: Mi è sempre piaciuto aiutare gli altri. Per questo motivo — quando sono venuto a conoscenza di <a href="https://www.empatica.com" target="empatica" rel="noopener">Empatica</a> — candidarsi è stata una scelta abbastanza naturale.

# firstCarTitle
source: Got my first car!
it: Preso la mia prima auto!

# firstCarDescription
source: With solar panels and a battery at home, buying a fully electric car seemed a beneficial choice both for the environment and for me. For this reason I bought a <a href="https://web.archive.org/web/20191210060826/https://www.nissanusa.com/vehicles/electric-cars/leaf.html" target="nissan-leaf-2019" rel="noopener">2019 Nissan Leaf</a>, possibly being one of the first people buying an e-car as their very first car—at least in Italy.
it: Con pannelli fotovoltaici e batteria d'accumulo a casa, comprare un auto totalmente elettrica sembrava una scelta da cui sia io che l'ambiente avremmo potuto trarre beneficio. Per questo motivo ho comprato una <a href="https://web.archive.org/web/20190923145720/https://www.nissan.it/veicoli/veicoli-nuovi/leaf.html" target="nissan-leaf-2019" rel="noopener">Nissan Leaf del 2019</a>, probablimente diventando una delle prime persone a comprare un'auto elettrica come propria prima auto in assoluto — perlomeno in Italia.
